In [1]:
import pandas as pd

In [3]:
pip install pandas

SyntaxError: invalid syntax (1048225456.py, line 1)

In [4]:
pip install pandas

Requirement already satisfied: pandas in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [5]:
pip install pandas

Requirement already satisfied: pandas in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [6]:
pip install pandas

Requirement already satisfied: pandas in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\91897\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [9]:
import pandas as pd
labels=['a','b','c','d','e']
data=[10,20,30,40,50]
Series_with_labels=pd.Series(data,index=labels)
print("pandas Series with labels:")
print("Roll No:23G01A4331")
print(Series_with_labels)

pandas Series with labels:
Roll No:23G01A4331
a    10
b    20
c    30
d    40
e    50
dtype: int64

In [11]:
type(Series_with_labels)

pandas.core.series.Series

In [14]:
data_dict={"a":100,"b":200,"c":300,"d":400,"e":500}
Series_from_dict=pd.Series(data_dict)
print("\n Pandas Series from Dictionary:")
print(Series_from_dict)

 Pandas Series from Dictionary:
a    100
b    200
c    300
d    400
e    500
dtype: int64

In [19]:
data_dict_df={
    "Name":["Ravi","Elon","Sathya","Rossum","Devara","Keshava"],
    "Age":[22,30,21,20,23,32],
    "Salary":[30000,25000,35000,60000,50000,10000]
}
df=pd.DataFrame(data_dict_df)
print("\nRoll No:23G01A4331")
print("\n pandas DataFrame:")
print(df)
type(data_dict_df)

Roll No:23G01A4331

 pandas DataFrame:
      Name  Age  Salary
0     Ravi   22   30000
1     Elon   30   25000
2   Sathya   21   35000
3   Rossum   20   60000
4   Devara   23   50000
5  Keshava   32   10000

dict

In [20]:
df.describe()

             Age       Salary
count   6.000000      6.00000
mean   24.666667  35000.00000
std     5.046451  17888.54382
min    20.000000  10000.00000
25%    21.250000  26250.00000
50%    22.500000  32500.00000
75%    28.250000  46250.00000
max    32.000000  60000.00000

In [21]:
df.describe()

             Age       Salary
count   6.000000      6.00000
mean   24.666667  35000.00000
std     5.046451  17888.54382
min    20.000000  10000.00000
25%    21.250000  26250.00000
50%    22.500000  32500.00000
75%    28.250000  46250.00000
max    32.000000  60000.00000

In [22]:
df.head()

     Name  Age  Salary
0    Ravi   22   30000
1    Elon   30   25000
2  Sathya   21   35000
3  Rossum   20   60000
4  Devara   23   50000

In [23]:
df.head(3)

     Name  Age  Salary
0    Ravi   22   30000
1    Elon   30   25000
2  Sathya   21   35000

In [24]:
df.tail()

      Name  Age  Salary
1     Elon   30   25000
2   Sathya   21   35000
3   Rossum   20   60000
4   Devara   23   50000
5  Keshava   32   10000

In [25]:
df.tail(3)

      Name  Age  Salary
3   Rossum   20   60000
4   Devara   23   50000
5  Keshava   32   10000

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Salary  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes